       01  SALESREP-MASTER-RECORD.
           05 SM-SALESREP-NUMBER     PIC 9(2).
           05 SM-SALESREP-NAME       PIC X(10).
           05 FILLER                 PIC X(118).